# Eliminar, modificar datos a un dataframe

In [1]:
import pandas as pd

In [6]:
df_books = pd.read_csv("./bestsellers-with-categories.csv", sep=',', header=0)
df_books.head(2)

,Name,Author,User Rating,Reviews,Price,Year,Genre
0,10-Day Green Smoothie Cleanse,JJ Smith,4.7,17350,8,2016,Non Fiction
1,11/22/63: A Novel,Stephen King,4.6,2052,22,2011,Fiction

### Eliminar columnas

Indicamos el nombre de la columa y la dimension en donde la borraremos, inplace nos indica si queremos que los efectos se guarden en df_books

In [7]:
df_books.drop("Genre", axis=1, inplace=True).head(2)

,Name,Author,User Rating,Reviews,Price,Year
0,10-Day Green Smoothie Cleanse,JJ Smith,4.7,17350,8,2016
1,11/22/63: A Novel,Stephen King,4.6,2052,22,2011

### Eliminar filas

Primero veamos que hay en el dataframe

In [8]:
df_books.head(2)

,Name,Author,User Rating,Reviews,Price,Year,Genre
0,10-Day Green Smoothie Cleanse,JJ Smith,4.7,17350,8,2016,Non Fiction
1,11/22/63: A Novel,Stephen King,4.6,2052,22,2011,Fiction

Ahora eliminemos el primer elemento

In [11]:
df_books.drop(0, axis=0).head(2)

,Name,Author,User Rating,Reviews,Price,Year,Genre
1,11/22/63: A Novel,Stephen King,4.6,2052,22,2011,Fiction
2,12 Rules for Life: An Antidote to Chaos,Jordan B. Peterson,4.7,18979,15,2018,Non Fiction

Ahora eliminemos varios valores

In [12]:
df_books.drop([0,1], axis=0).head(2)

,Name,Author,User Rating,Reviews,Price,Year,Genre
2,12 Rules for Life: An Antidote to Chaos,Jordan B. Peterson,4.7,18979,15,2018,Non Fiction
3,1984 (Signet Classics),George Orwell,4.7,21424,6,2017,Fiction

Cabe recalcar que prodriamos usar un range para eliminar varios elementos

### Agregar Columnas

Veamos el dataframe hasta el momento

In [13]:
df_books.head(2)

,Name,Author,User Rating,Reviews,Price,Year,Genre
0,10-Day Green Smoothie Cleanse,JJ Smith,4.7,17350,8,2016,Non Fiction
1,11/22/63: A Novel,Stephen King,4.6,2052,22,2011,Fiction

Para agregar utilizaremos numpy para crear esta columna

In [15]:
import numpy as np
data_column = np.arange(0, df_books.shape[0])

Ahora con este arreglo de numpy, añadiremos la columna

In [16]:
df_books['Rango'] = data_column

In [17]:
df_books.head(2)

,Name,Author,User Rating,Reviews,Price,Year,Genre,Rango
0,10-Day Green Smoothie Cleanse,JJ Smith,4.7,17350,8,2016,Non Fiction,0
1,11/22/63: A Novel,Stephen King,4.6,2052,22,2011,Fiction,1

Vemos que hemos añadido la columna, es importante verificar que el arreglo que añadiremos como columna tiene el mismo numero de elementos como registros en el dataframe

### Añadir filas

Esto se hace muy simple con la funcion append

In [18]:
df_books.append(df_books)

,Name,Author,User Rating,Reviews,Price,Year,Genre,Rango
0,10-Day Green Smoothie Cleanse,JJ Smith,4.7,17350,8,2016,Non Fiction,0
1,11/22/63: A Novel,Stephen King,4.6,2052,22,2011,Fiction,1
2,12 Rules for Life: An Antidote to Chaos,Jordan B. Peterson,4.7,18979,15,2018,Non Fiction,2
3,1984 (Signet Classics),George Orwell,4.7,21424,6,2017,Fiction,3
4,"5,000 Awesome Facts (About Everything!) (Natio...",National Geographic Kids,4.8,7665,12,2019,Non Fiction,4
...,...,...,...,...,...,...,...,...
545,Wrecking Ball (Diary of a Wimpy Kid Book 14),Jeff Kinney,4.9,9413,8,2019,Fiction,545
546,You Are a Badass: How to Stop Doubting Your Gr...,Jen Sincero,4.7,14331,8,2016,Non Fiction,546
547,You Are a Badass: How to Stop Doubting Your Gr...,Jen Sincero,4.7,14331,8,2017,Non Fiction,547
548,You Are a Badass: How to Stop Doubting Your Gr...,Jen Sincero,4.7,14331,8,2018,Non Fiction,548
549,You Are a Badass: How to Stop Doubting Your Gr...,Jen Sincero,4.7,14331,8,2019,Non Fiction,549

En este caso duplicamos el dataframe :D